{
   "class_name": "Functional",
   "config": {
      "name": "LeNet_5",
      "layers": [
         {
            "class_name": "InputLayer",
            "config": {
               "batch_input_shape": [
                  null,
                  28,
                  28,
                  1
               ],
               "dtype": "float32",
               "sparse": false,
               "ragged": false,
               "name": "input_1"
            },
            "name": "input_1",
            "inbound_nodes": []
         },
         {
            "class_name": "ZeroPadding2D",
            "config": {
               "name": "zero_padding2d",
               "trainable": true,
               "dtype": "float32",
               "padding": [
                  [
                     2,
                     2
                  ],
                  [
                     2,
                     2
                  ]
               ],
               "data_format": "channels_last"
            },
            "name": "zero_padding2d",
            "inbound_nodes": [
               [
                  [
                     "input_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d",
               "trainable": true,
               "dtype": "float32",
               "filters": 6,
               "kernel_size": [
                  5,
                  5
               ],
               "strides": [
                  2,
                  2
               ],
               "padding": "valid",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "groups": 1,
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv2d",
            "inbound_nodes": [
               [
                  [
                     "zero_padding2d",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "x1",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "x1",
            "inbound_nodes": [
               [
                  [
                     "conv2d",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "TFOpLambda",
            "config": {
               "name": "tf.nn.max_pool_with_argmax",
               "trainable": true,
               "dtype": "float32",
               "function": "nn.max_pool_with_argmax"
            },
            "name": "tf.nn.max_pool_with_argmax",
            "inbound_nodes": [
               [
                  "x1",
                  0,
                  0,
                  {
                     "ksize": [
                        2,
                        2
                     ],
                     "strides": [
                        2,
                        2
                     ],
                     "padding": "VALID",
                     "name": "pooled_x1"
                  }
               ]
            ]
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_1",
               "trainable": true,
               "dtype": "float32",
               "filters": 16,
               "kernel_size": [
                  5,
                  5
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "valid",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "groups": 1,
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv2d_1",
            "inbound_nodes": [
               [
                  [
                     "tf.nn.max_pool_with_argmax",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "x2",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "x2",
            "inbound_nodes": [
               [
                  [
                     "conv2d_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "TFOpLambda",
            "config": {
               "name": "tf.nn.max_pool_with_argmax_1",
               "trainable": true,
               "dtype": "float32",
               "function": "nn.max_pool_with_argmax"
            },
            "name": "tf.nn.max_pool_with_argmax_1",
            "inbound_nodes": [
               [
                  "x2",
                  0,
                  0,
                  {
                     "ksize": [
                        2,
                        2
                     ],
                     "strides": [
                        2,
                        2
                     ],
                     "padding": "VALID",
                     "name": "pooled_x2"
                  }
               ]
            ]
         },
         {
            "class_name": "Flatten",
            "config": {
               "name": "flatten",
               "trainable": true,
               "dtype": "float32",
               "data_format": "channels_last"
            },
            "name": "flatten",
            "inbound_nodes": [
               [
                  [
                     "tf.nn.max_pool_with_argmax_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dense",
            "config": {
               "name": "dense",
               "trainable": true,
               "dtype": "float32",
               "units": 120,
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L2",
                  "config": {
                     "l2": 0.0020000000949949026
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
               [
                  [
                     "flatten",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation",
            "inbound_nodes": [
               [
                  [
                     "dense",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dense",
            "config": {
               "name": "dense_1",
               "trainable": true,
               "dtype": "float32",
               "units": 84,
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L2",
                  "config": {
                     "l2": 0.0020000000949949026
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "dense_1",
            "inbound_nodes": [
               [
                  [
                     "activation",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_1",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_1",
            "inbound_nodes": [
               [
                  [
                     "dense_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dense",
            "config": {
               "name": "dense_2",
               "trainable": true,
               "dtype": "float32",
               "units": 10,
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L2",
                  "config": {
                     "l2": 0.0020000000949949026
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "dense_2",
            "inbound_nodes": [
               [
                  [
                     "activation_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_2",
               "trainable": true,
               "dtype": "float32",
               "activation": "softmax"
            },
            "name": "activation_2",
            "inbound_nodes": [
               [
                  [
                     "dense_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         }
      ],
      "input_layers": [
         [
            "input_1",
            0,
            0
         ]
      ],
      "output_layers": [
         [
            "activation_2",
            0,
            0
         ]
      ]
   },
   "keras_version": "2.10.0",
   "backend": "tensorflow"
}